app/views/students/edit.html.erb

	<%= form.label :college_name %> &emsp;
	<%= form.collection_select :college_id, College.order(:name),:id,:name, include_blank: true %>
---
SELECT `colleges`.* FROM `colleges` ORDER BY `colleges`.`name` ASC