app/views/students/new.html.erb

		<%= form.label :student_gender %><font color="red">*</font> &emsp;
		<%= form.select :gender, %w{Male Female}, :prompt => 'Select', required: true, placeholder: 'Student', class: 'form-control' %>
---
SELECT `students`.* FROM `students` ORDER BY `students`.`gender` ASC

		<%= form.label :student_college %><font color="red">*</font> &nbsp;&nbsp;
	  <%= form.collection_select :college_id, College.order(:name),:id,:name, include_blank: true %>
---
SELECT `colleges`.* FROM `colleges` ORDER BY `colleges`.`name` ASC