app/controllers/colleges_controller.rb

  def index
      @colleges = College.all
---
SELECT `colleges`.* FROM `colleges`

  def edit
  	@college = College.find(params[:id])
---
SELECT  `colleges`.* FROM `colleges` WHERE `colleges`.`id` = 10 LIMIT 1

  def create
  	@college =College.new(college_params)

  	if @college.save
---
INSERT INTO `colleges` (`name`, `department`, `created_at`, `updated_at`) VALUES ('Liberal Arts', 'Design and Finance', '2019-03-27 13:08:59', '2019-03-27 13:08:59')

  def update
    @college = College.find(params[:id])
    if @college.update(college_params)
---
SELECT  `colleges`.* FROM `colleges` WHERE `colleges`.`id` = 3 LIMIT 1
UPDATE `colleges` SET `department` = 'Fashin', `updated_at` = '2019-03-27 09:56:22' WHERE `colleges`.`id` = 10

 def destroy
   @college =College.find(params[:id])
   @college.destroy
---
SELECT  `colleges`.* FROM `colleges` WHERE `colleges`.`id` = 11 LIMIT 1
DELETE FROM `colleges` WHERE `colleges`.`id` = 11

 def show
   @college = College.find(params[:id])
---
SELECT  `colleges`.* FROM `colleges` WHERE `colleges`.`id` = 11 LIMIT 1