app/controllers/students_controller.rb

	def index
		if params[:college_id].present?
			@students = College.find(params[:college_id]).students
		else
			@students = Student.all
---
SELECT `students`.* FROM `students` WHERE `students`.`college_id` = 1
SELECT  `colleges`.* FROM `colleges` WHERE `colleges`.`id` = 1 LIMIT 1
SELECT `students`.* FROM `students`

	def new
		if params[:college_id].present?
			@students = College.find(params[:college_id]).students
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 2 LIMIT 1
SELECT  `colleges`.* FROM `colleges` WHERE `colleges`.`id` = 14 LIMIT 1

	def create
		@student = Student.new(student_params)

		if @student.save
---
INSERT INTO `students` (`firstname`, `address`, `college_id`, `created_at`, `updated_at`, `age`, `gender`, `email`, `lastname`) VALUES ('Rahul', '401- Vascon tower, Above Samsung, Banner-pashan link road.', 14, '2019-04-01 05:31:39', '2019-04-01 05:31:39', 25, 'Male', 'xyez@gmail.com', 'Khandekar')

	def update
		if @student.update(student_params)
---
UPDATE `students` SET `gender` = 'Male', `lastname` = 'Desouza', `email` = 'xyz@gmail.com', `updated_at` = '2019-03-29 04:37:34' WHERE `students`.`id` = 2

	def destroy
		@student.destroy
---
DELETE FROM `students` WHERE `students`.`id` = 16

	def find_student
		@student =Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 16 LIMIT 1